export type IAboutItemId = string;
export interface IAboutItem {
  id: IAboutItemId;
  order: number;
  type: string;
  name: string;
  title: string;
  description: string;
  services: IServiceItem[];
}
export interface IServiceItem {
  type: string;
  name: string;
  description: string;
}
export const aboutItems: IAboutItem[] = [
  {
    id: 'programs',
    order: 1,
    type: 'banks',
    name: 'Платформа для банков',
    description:
      'Взаимодействие между коммерческими банками и АО Росэксимбанк в рамках программ государственной поддержки экспортёров',
    title: 'Программы',
    services: [
      {
        type: 'light',
        name: 'Выгодные решения для экспортеров',
        description:
          'Вы экспортер или покупатель российских товаров и услуг? У нас есть решения, которые помогут вам развить бизнес и достичь новых высот. Узнайте больше о кредитных продуктах Росэксимбанка',
      },
      {
        type: 'light',
        name: 'Быстро и надежно',
        description:
          '• Предэкспортное финансирование\n' +
          '• Финансирование дебиторской задолженности\n' +
          '• Экспортный стандарт',
      },
    ],
  },
  {
    id: 'products',
    order: 2,
    type: 'exporters',
    name: 'Льготное финансирование экспортёров',
    description: 'Программы для экспортеров',
    title: 'Продукты',
    services: [
      {
        type: 'bars',
        name: 'Фондирование',
        description:
          'Предоставление целевого льготного межбансковского кредита АО Росэксимбанка для последующего финансирования экспортеров',
      },
      {
        type: 'list',
        name: 'Кредит под резервный аккредитив',
        description:
          'Предоставление АО Росэксимбанк льготного кредита экспортеру под обеспечение обслуживающего банка в виде резервного аккредитива',
      },
      {
        type: 'pie',
        name: 'Софинансирование',
        description:
          'Предоставление синдицированных кредитов и кредитов с субучастием экспортерам',
      },
    ],
  },
  {
    id: 'services',
    order: 3,
    type: 'ved',
    name: 'Cервисы для участников ВЭД',
    description:
      'Подбор комплекса услуг по сопровождению, анализу и проведениюэкспортных операций',
    title: 'Сервисы',
    services: [
      {
        type: 'bars',
        name: 'Подбор программ',
        description:
          'Надежность государственного банка с рейтингом российского агентства RAEX на уровне ruАA (высокий уровень кредитоспособности) и международного агентства Moody’s Investors Service на уровне Ва1 прогноз «стабильный»',
      },
      {
        type: 'list',
        name: 'Cопровождение',
        description:
          'Конкурентные тарифы и условия проведения расчетов, включая бесплатное открытие и ведение счетов и бесплатное сопровождение системы дистанционного банковского обслуживания',
      },
      {
        type: 'pie',
        name: 'Анализ документов',
        description:
          'Бесплатная предварительная экспертиза документов при принятии контракта, договора на обслуживание в банк, открытии паспорта сделки, планируемом проведении операции',
      },
    ],
  },
];
