type IErrors = Record<string, {[key: string]: string}>;

const mapErrorsDescription: IErrors = {
  '4xx': {
    '400': 'Ошибка в запросе к серверу',
    '401': 'Ошибка авторизизации',
    '402': 'Неверные данные авторизации(логи или пароль)',
    '403': 'У вас нет разрешения для доступа к ресурсам данной страницы',
    '404': 'Адрес запрашиваемого ресурса не существует',
    '405': 'Используется запрещенный метод запроса данных',
    '406': 'Нечитаемый формат страницы',
    '407':
      'Для дальнейшего получения ресурса требуется дополнительная авторизация',
    '408': 'Очень долгое подключение к серверу. Сервер разорвал соединение.',
    '409': 'Неверные отправленные данные',
    '410': 'Запрашиваемая страница больше не существует',
  },
  '5xx': {
    '500': 'Ошибка сервера',
    '501': 'Ошибка сервера. Сервер не может обработать данные',
    '502': 'Ошибка подключения к серверу',
    '503': 'Сервер временно не доступен',
    '504': 'Запрашиваемый сервис не отвечает',
    '505': 'Для передачи данных используйте HTTPS протокол',
  },
};

export const getResponseStatusCodeMessage = (error?: number) => {
  if (error) {
    const val = `${error}`.trim()[0] + `xx`;
    return mapErrorsDescription[val][error];
  }
  return 'Неизвестная ошибка';
};
