import React from 'react';
import {ModalPage} from '../../../Common/SimpleComponents/ModalPage';
import './index.less';

interface IDialogAccreditationDocumentsProps {
  isOpen: boolean;
  onClose: () => void;
}

export const DialogAccreditationDocuments = (
  props: IDialogAccreditationDocumentsProps
) => {
  const {isOpen, onClose} = props;
  return (
    <ModalPage
      className="dialog-accreditation-documents"
      onClose={onClose}
      isOpen={isOpen}
      header={{
        title: 'Список документов для прохождения процедуры аккредитации',
      }}
      footerButtonConfig={[
        {
          children: 'Закрыть',
          onClick: onClose,
          whiteTheme: true,
        },
      ]}
    >
      <ul>
        <li>
          <span>
            Свидетельство о государственной регистрации юридического лица (для
            ЮЛ, зарегистрированных не ранее 1.07.2002) / Свидетельство о
            внесении записи в ЕГРЮЛ о юридическом лице, зарегистрированном до
            01.07.2002
          </span>
        </li>
        <li>
          <span>
            Действующие редакции учредительных документов и все изменения к ним
          </span>
        </li>
        <li>
          <span>
            Свидетельство о постановке на учет юридического лица в налоговом
            органе по месту нахождения на территории РФ
          </span>
        </li>
        <li>
          <span>
            Нотариально заверенный оригинал или нотариально заверенная копия с
            нотариально заверенного оригинала банковской карточки
          </span>
        </li>
        <li>
          <span>
            Документы, подтверждающие назначение (избрание) единоличного
            исполнительного органа и главного бухгалтера
          </span>
        </li>
        <li>
          <span>
            Документ, подтверждающий назначение (избрание) коллегиального органа
            в составе, назначившем (избравшем) единоличный исполнительный орган
          </span>
        </li>
        <li>
          <span>Лицензии профессионального участника рынка ценных бумаг</span>
        </li>
        <li>
          <span>
            Информационное письмо Федеральной службы государственной статистики
            (коды государственной статистики) / Уведомление об идентификационных
            кодах (заверенные печатью Клиента)
          </span>
        </li>
        <li>
          <span>Копии паспортов Уполномоченных представителей </span>
        </li>
        <li>
          <span>Структура владения компании </span>
        </li>
        <li>
          <span>
            Письма ГУ ЦБ РФ о согласовании кандидатур на должность единоличного
            исполнительного органа кредитной организации
          </span>
        </li>
        <li>
          <span>Лицензия кредитной организации </span>
        </li>
        <li>
          <span>
            W-8BEN-E, W-8IMY, W-8EXP, W-9 (в случаях, когда применимо){' '}
          </span>
        </li>
        <li>
          <span>Анкета Банка для аккредитации (во вложении)</span>
        </li>
      </ul>
    </ModalPage>
  );
};
